trade_exp/src/Documents/УстановкаСтатусовВодителей/УстановкаСтатусовВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="99f0c7c8-eaf0-4c4f-9756-1838f9d692b9">
  <name>УстановкаСтатусовВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="da9a087c-ce8d-4646-8aa2-1a172ecc5a15">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08d8472a-b357-4d43-bc3c-88b576fbd1a9">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adbff1ea-ea9a-4a88-89d4-dbaf35a83198">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e983d47e-e6da-4d5e-b334-8521a41befb5">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/InformationRegisters/СтатусыВодителей/СтатусыВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="818744fb-c386-43c6-9019-6698d3e9f4c1">
  <name>СтатусыВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="61d8b056-4dda-43aa-9255-dfb75ae8ffa9">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="81803890-4870-45c0-8271-dd15e272d917">
    <name>Рейс</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="6830df13-090e-4361-a92a-1ce174c899d0">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="bd34926c-a1c5-4748-a383-a4accb727902">
    <name>ДатаПрибытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="78d0e85f-15e5-4da2-9253-fdcdf57ffbd3">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="acd5498b-e41d-4262-8314-d5f756a749c0">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="003bb52b-599e-4135-a3fc-ab735d3f49db">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/УстановкаСтатусовВодителей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СтатусыВодителей
	//Движения.СтатусыВодителей.Записывать = Истина;
	//Движение = Движения.СтатусыВодителей.Добавить();
	//Движение.Период = Дата;
	//Движение.Водитель = Водитель;
	//Движение.Статус = Статус;
	АльтерраОбщегоНазначения.УстановитьСтатусВодителю(Водитель, Статус, Комментарий);
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	НаборЗаписей = РегистрыСведений.СтатусыВодителей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Водитель.Установить(Водитель);
	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Автор = Справочники.Пользователи.ПустаяСсылка() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
